
/**************************************************************
  SYMTAB.H
 **************************************************************/

/*************************************
  Структура записи в таблице символов
 *************************************/
#ifdef __cplusplus
extern "C"
{
#endif

typedef struct symbol SYMBOL;
struct symbol
{
   char *name;          /* имя переменной или функции */
   int   type;          /* тип: VAR, BLTIN, UNDEF     */
   char *expr;          /* частично разобранное выражение для типов VAR и UNDEF */
   union
   {
      double val;       /* значение для переменной( VAR )           */
      double (*ptr)();  /* указатель на встроенную функцию( BLTIN ) */
   } u;

   struct symbol *next; /* связь со следующей записью */
};

/************************************************************
  Декларация функций добавления записи и поиска существующей
 ************************************************************/
extern SYMBOL *install( char *s, int t, double d );
extern SYMBOL *lookup( char *s );

#ifdef __cplusplus
}
#endif
/******************  END OF FILE SYMTAB.H  ********************/
